hr11C_sbSlipShm/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "0.2/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          6272;
        startFace       578716;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          6000;
        startFace       584988;
    }
    inlet
    {
        type            patch;
        nFaces          900;
        startFace       590988;
    }
    outlet
    {
        type            patch;
        nFaces          900;
        startFace       591888;
    }
    side01
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          6000;
        startFace       592788;
    }
    side02
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          6000;
        startFace       598788;
    }
    box
    {
        type            wall;
        inGroups        1(wall);
        nFaces          8000;
        startFace       604788;
    }
)

// ************************************************************************* //
